# Introdução ao pandas
Guia básico

In [0]:
import pandas as pd
import numpy as np

In [0]:
#Criando uma série e passandos os valore
s = pd.Series([1, 3, 5, np.nan, 6, 9, 15])
print(s)

0     1.0
1     3.0
2     5.0
3     NaN
4     6.0
5     9.0
6    15.0
dtype: float64

In [0]:
# Criando Dataframe com array numpy 
dates = pd.date_range('20130101', periods = 6) #passamos a data e quantos períodos em dias
print(dates)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
#Crinado um Dataframe com números aleatórios contendo 6 linas e 4 colunas
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.405504 -1.779254 -0.546752  1.610266
2013-01-02 -1.578147 -1.119761  1.234060 -0.400535
2013-01-03 -1.020955 -1.115547 -1.380094 -0.466280
2013-01-04  0.186824 -0.101365 -0.427483  1.756040
2013-01-05  1.655064  0.244399 -0.523301 -0.183911
2013-01-06  0.031059 -0.807516 -1.341540 -0.721306

In [0]:
#Criando um Dataframe passando um dicionário
# Dicionários recebem {Chave: valor}
dfdict = pd.DataFrame({'A': 100,
                       'B': pd.Timestamp('20130101'),
                       'C': pd.Series(1, index=(range(4)), dtype='float32'),
                       'D': np.array([3]* 4, dtype='int32'),
                       'E': pd.Categorical(['teste,','Treino','Teste','Treino']),
                       'F': 'fo'})
dfdict

     A          B    C  D       E   F
0  100 2013-01-01  1.0  3  teste,  fo
1  100 2013-01-01  1.0  3  Treino  fo
2  100 2013-01-01  1.0  3   Teste  fo
3  100 2013-01-01  1.0  3  Treino  fo

In [0]:
#Descobrindo o tipo de dados do Dataframe
dfdict.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [0]:
#Mostrando a "cabeça" do dataframe(2 primeiras linhas)
df.head(2)

                   A         B         C         D
2013-01-01  0.405504 -1.779254 -0.546752  1.610266
2013-01-02 -1.578147 -1.119761  1.234060 -0.400535

In [0]:
#Mostrando o "pé" do dataframe(2 últimas linhas)
df.tail(2)

                   A         B         C         D
2013-01-05  1.655064  0.244399 -0.523301 -0.183911
2013-01-06  0.031059 -0.807516 -1.341540 -0.721306

In [0]:
#Mostrando o indíce do Dataframe
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [0]:
#Mostrando o indíce do Dataframe (dfdict)
dfdict.index

RangeIndex(start=0, stop=4, step=1)

In [0]:
#Tranformando Datafrane em um array numpy
dfdict.to_numpy()

array([[100, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'teste,', 'fo'],
       [100, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'Treino', 'fo'],
       [100, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'Teste', 'fo'],
       [100, Timestamp('2013-01-01 00:00:00'), 1.0, 3, 'Treino', 'fo']],
      dtype=object)

In [0]:
#Mostrando resumo estatisticos do Dataframe
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.053442 -0.779841 -0.497518  0.265712
std    1.136248  0.739896  0.948437  1.112202
min   -1.578147 -1.779254 -1.380094 -0.721306
25%   -0.757951 -1.118708 -1.142843 -0.449844
50%    0.108942 -0.961532 -0.535026 -0.292223
75%    0.350834 -0.277903 -0.451438  1.161721
max    1.655064  0.244399  1.234060  1.756040

In [0]:
#Alterando de linhas para colunas
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.405504   -1.578147   -1.020955    0.186824    1.655064    0.031059
B   -1.779254   -1.119761   -1.115547   -0.101365    0.244399   -0.807516
C   -0.546752    1.234060   -1.380094   -0.427483   -0.523301   -1.341540
D    1.610266   -0.400535   -0.466280    1.756040   -0.183911   -0.721306

In [0]:
#Organizando dados
df.sort_index(axis=0, ascending=True)

                   A         B         C         D
2013-01-01  0.405504 -1.779254 -0.546752  1.610266
2013-01-02 -1.578147 -1.119761  1.234060 -0.400535
2013-01-03 -1.020955 -1.115547 -1.380094 -0.466280
2013-01-04  0.186824 -0.101365 -0.427483  1.756040
2013-01-05  1.655064  0.244399 -0.523301 -0.183911
2013-01-06  0.031059 -0.807516 -1.341540 -0.721306

In [0]:
#Organizando dados por uma coluna específica
df.sort_values(by='B')

                   A         B         C         D
2013-01-01  0.405504 -1.779254 -0.546752  1.610266
2013-01-02 -1.578147 -1.119761  1.234060 -0.400535
2013-01-03 -1.020955 -1.115547 -1.380094 -0.466280
2013-01-06  0.031059 -0.807516 -1.341540 -0.721306
2013-01-04  0.186824 -0.101365 -0.427483  1.756040
2013-01-05  1.655064  0.244399 -0.523301 -0.183911

### Selecionando dados
Comandos que selecionam dados

In [0]:
#Selecionando uma coluna do Dataframe
df['A']

2013-01-01    0.405504
2013-01-02   -1.578147
2013-01-03   -1.020955
2013-01-04    0.186824
2013-01-05    1.655064
2013-01-06    0.031059
Freq: D, Name: A, dtype: float64

In [0]:
#Selecionando intervalo de linhas
df[0:2]

                   A         B         C         D
2013-01-01  0.405504 -1.779254 -0.546752  1.610266
2013-01-02 -1.578147 -1.119761  1.234060 -0.400535

In [0]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -1.578147 -1.119761  1.234060 -0.400535
2013-01-03 -1.020955 -1.115547 -1.380094 -0.466280
2013-01-04  0.186824 -0.101365 -0.427483  1.756040

In [0]:
#Selecionando através do loc
df.loc[dates[1]]

A   -1.578147
B   -1.119761
C    1.234060
D   -0.400535
Name: 2013-01-02 00:00:00, dtype: float64

In [0]:
#Selecinando todas as linhas e as colunas A e C do Dataframe
df.loc[:, ['A', 'C']]

                   A         C
2013-01-01  0.405504 -0.546752
2013-01-02 -1.578147  1.234060
2013-01-03 -1.020955 -1.380094
2013-01-04  0.186824 -0.427483
2013-01-05  1.655064 -0.523301
2013-01-06  0.031059 -1.341540

In [0]:
# Selecionando intervalo de datas e as colunas A e C do Dataframe
df.loc['20130102':'20130104', ['A', 'C']]

                   A         C
2013-01-02 -1.578147  1.234060
2013-01-03 -1.020955 -1.380094
2013-01-04  0.186824 -0.427483

In [0]:
# Selecionando somente uma data e retorna os valores colunas A e C do Dataframe
df.loc['20130102', ['A', 'B']]

A   -1.578147
B   -1.119761
Name: 2013-01-02 00:00:00, dtype: float64

In [0]:
# Selecionando linha 0 e coluna A
df.loc[dates[0], 'A']

0.40550406783562765

In [0]:
# Usando at
df.at[dates[0], 'A']

0.40550406783562765

In [0]:
# Usando iloc, ou  seja selecinando os dados por posição. 
# iloc[intervalo:linhas, intervalo:colunas]
df.iloc[3:5, 0:3]

                   A         B         C
2013-01-04  0.186824 -0.101365 -0.427483
2013-01-05  1.655064  0.244399 -0.523301

In [0]:
#Passando listas para o iloc
#Linnhas 1, 2, 4 , colunas A e C
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.578147  1.234060
2013-01-03 -1.020955 -1.380094
2013-01-05  1.655064 -0.523301

In [0]:
#Selecionando de 0 a 3 em linhas todas as colunas
#Seleciona Fatias do Dataframe
df.iloc[0:3, :]

                   A         B         C         D
2013-01-01  0.405504 -1.779254 -0.546752  1.610266
2013-01-02 -1.578147 -1.119761  1.234060 -0.400535
2013-01-03 -1.020955 -1.115547 -1.380094 -0.466280

In [0]:
#Seleciona Fatias do Dataframe
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.779254 -0.546752
2013-01-02 -1.119761  1.234060
2013-01-03 -1.115547 -1.380094
2013-01-04 -0.101365 -0.427483
2013-01-05  0.244399 -0.523301
2013-01-06 -0.807516 -1.341540

In [0]:
# Selecinando valor específico
df.iloc[1, 1]

-1.119761130161268

In [0]:
# Com iat
df.iat[1, 1]

-1.119761130161268

In [0]:
#Usando critérios para selecionar dados
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.405504 -1.779254 -0.546752  1.610266
2013-01-04  0.186824 -0.101365 -0.427483  1.756040
2013-01-05  1.655064  0.244399 -0.523301 -0.183911
2013-01-06  0.031059 -0.807516 -1.341540 -0.721306

In [0]:
#Usando critérios para selecionar dados
# Em todo o Dataframe exibe os valores maiores que 0
df[df > 0]

                   A         B        C         D
2013-01-01  0.405504       NaN      NaN  1.610266
2013-01-02       NaN       NaN  1.23406       NaN
2013-01-03       NaN       NaN      NaN       NaN
2013-01-04  0.186824       NaN      NaN  1.756040
2013-01-05  1.655064  0.244399      NaN       NaN
2013-01-06  0.031059       NaN      NaN       NaN

In [0]:
#Usando isin() 
#Atribuir ao df2 uma cópia do df
df2 = df.copy()
#Adicionando uma coluna
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.405504 -1.779254 -0.546752  1.610266    one
2013-01-02 -1.578147 -1.119761  1.234060 -0.400535    one
2013-01-03 -1.020955 -1.115547 -1.380094 -0.466280    two
2013-01-04  0.186824 -0.101365 -0.427483  1.756040  three
2013-01-05  1.655064  0.244399 -0.523301 -0.183911   four
2013-01-06  0.031059 -0.807516 -1.341540 -0.721306  three

In [0]:
# Método "pergunta está em?"
# No df2 na coluna E está/existe/dentro two e four
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03 -1.020955 -1.115547 -1.380094 -0.466280   two
2013-01-05  1.655064  0.244399 -0.523301 -0.183911  four